# BuiltInFailures.CopyPasteFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures Class
BuiltInFailures Class Members See Also
---
Failures about CopyPasteFailures.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class CopyPasteFailures
```

Visual Basic
---
```text
Public NotInheritable Class CopyPasteFailures
```

Visual C++
---
```text
public ref class CopyPasteFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..CopyPasteFailures
# See Also
BuiltInFailures..::..CopyPasteFailures Members
Autodesk.Revit.DB Namespace